clc;
clear;
close all;
%这个是例2.11的实例程序
%{
    只是一个简单的贝叶斯网络：只有4个变量，且4个变量都为二进制值
%}
%{
    基本参量：--已知参量
     1.P(x=1)-------Px1
     2.P(y=1|x=1)---Py1_x1
     3.P(y=1|x=0)---Py1_x0
     4.P(z=1|y=1)---Pz1_y1
     5.P(z=1|y=0)---Pz1_y0
     6.P(w=1|z=1)---Pw1_z1
     7.P(w=1|z=0)---Pw1_z0
    未知参量:--需要求的参量
     1.P(x=0)-------Px0
     2.P(y=0|x=1)---Py0_x1
     3.P(y=0|x=0)---Py0_x0
     4.P(z=0|y=1)---Pz0_y1
     5.P(z=0|y=0)---Pz0_y0
     6.P(w=0|z=1)---Pw0_z1
     7.P(w=0|z=0)---Pw0_z0
     8.P(y=1)-------Py1
     9.P(y=0)-------Py0
    10.P(z=1)-------Pz1
    11.P(z=0)-------Pz0
    12.P(w=1)-------Pw1
    13.P(w=0)-------Pw0
%}
%初始化
Px1    =0.60;
Py1_x1 =0.40;
Py1_x0 =0.30;
Pz1_y1 =0.25;
Pz1_y0 =0.60;
Pw1_z1 =0.45;
Pw1_z0 =0.30;
%基本概率的计算
Px0=1-Px1;
Py1=Py1_x1*Px1+Py1_x0*Px0;
Py0=1-Py1;
Pz1=Pz1_y1*Py1+Pz1_y0*Py0;
Pz0=1-Pz1;
Pw1=Pw1_z1*Pz1+Pw1_z0*Pz0;
Pw0=1-Pw1;
%条件概率的计算
Py0_x1=1-Py1_x1;
Py0_x0=1-Py1_x0;
Pz0_y1=1-Pz1_y1;
Pz0_y0=1-Pz1_y0;
Pw0_z1=1-Pw1_z1;
Pw0_z0=1-Pw1_z0;
%下面是针对例题中的要求进行一些计算
%(a)测试x并且得到他的值为x1(证据)。计算P(z=1|x=1)和P(w=0|x=1)
Pz1_x1=Pz1_y1*Py1_x1+Pz1_y0*Py0_x1;
Pz0_x1=1-Pz1_x1;
Pw0_x1=Pw0_z1*Pz1_x1+Pw0_z0*Pz0_x1;
%(b)测试w并且得到他的值为w1。计算P(x=0|w=1)和P(z=1|w=1)
Pz1_w1=Pw1_z1*Pz1/Pw1;
Pz0_x0=Pz0_y1*Py1_x0*Px0+Pz0_y0*Py0_x0*Px0;
Pz1_x0=1-Pz0_x0;
Pw1_x0=Pw1_z1*Pz1_x0+Pw1_z0*Pz0_x0;
Px0_w1=Pw1_x0*Px0/Pw1;
